#coding:utf-8
#MI5
device_id = 'c84e662d'
#组队开始按钮
start_fighting = {
    'y1':858,
    'y2':945,
    'x1':1432,
    'x2':1692
}
#胜利之后的大鼓的位置坐标
win_mark_drum = {
    'y1':209,
    'y2':387,
    'x1':621,
    'x2':826
}
#胜利之后的宝箱的下半部分坐标
win_mark_box={
    'y1':796,
    'y2':905,
    'x1':794,
    'x2':1093
}
#单人挑战按钮位置坐标
challenge_btn = {
    'y1':703,
    'y2':780,
    'x1':1335,
    'x2':1518
}
#单人失败之后的大鼓的位置坐标
single_failure = {
    'y1':195,
    'y2':423,
    'x1':604,
    'x2':872
}
#组队失败之后的位置坐标
team_failure = {
    'y1':209,
    'y2':387,
    'x1':621,
    'x2':826
}


#单人胜利之后出现大鼓时候点击位置，防止时延影响点到不该点的位置
win_mark_drum_tap = {
    'y1':87,
    'y2':953,
    'x1':30,
    'x2':210
}

#胜利之后出现宝箱之后，点击位置，防止时延影响点到不该点的位置
win_mark_box_tap={
    'y1':87,
    'y2':953,
    'x1':30,
    'x2':210
}


#胜利之后出现宝箱之后，点击位置，防止时延影响点到不该点的位置
single_failure_tap={
    'y1':87,
    'y2':953,
    'x1':30,
    'x2':210
}