#coding:utf-8
#MI8

device_id = '61e08bf1'
size = '2248x1080'

team_win_mark_box_threshold = (0.8276,0.0001)
start_fighting_threshold = (1.196,0.0001)
team_win_mark_drum_threshold = (0.8091,0.001)


#单人胜利之后出现大鼓时候点击位置，防止时延影响点到不该点的位置
win_mark_drum_tap2 = {
     'y1':346,
    'y2':740,
    'x1':300,
    'x2':350
}

#胜利之后出现宝箱之后，点击位置，防止时延影响点到不该点的位置
win_mark_box_tap2={
    'y1':346,
    'y2':740,
    'x1':300,
    'x2':350
}

#胜利之后出现宝箱之后，点击位置，防止时延影响点到不该点的位置
single_failure_tap2={
      'y1':346,
    'y2':740,
    'x1':300,
    'x2':350
}


#组队开始按钮
start_fighting2 = {
    'y1':870,
    'y2':929,
    'x1':1670,
    'x2':1896
}


#组队失败之后的位置坐标
team_failure2 = {
    'y1':139,
    'y2':248,
    'x1':836,
    'x2':995
}

#组队胜利之后的大鼓的位置坐标
team_win_mark_drum2 = {
    'y1':156,
    'y2':271,
    'x1':850,
    'x2':1030
}

#胜利之后的宝箱的下半部分坐标
team_win_mark_box2={
    'y1':870,
    'y2':923,
    'x1':1020,
    'x2':1323
}




#单人胜利之后的大鼓的位置坐标
win_mark_drum = {
    'y1':216,
    'y2':410,
    'x1':734,
    'x2':927
}

#胜利之后的宝箱的下半部分坐标
win_mark_box={
    'y1':878,
    'y2':944,
    'x1':894,
    'x2':1212
}

#单人挑战按钮位置坐标
challenge_btn = {
    'y1':709,
    'y2':773,
    'x1':1454,
    'x2':1620
}

#单人失败之后的大鼓的位置坐标
single_failure = {
    'y1':204,
    'y2':382,
    'x1':710,
    'x2':912
}


#通用的
#胜利之后出现大鼓时候点击位置，防止时延影响点到不该点的位置
win_mark_drum_tap = {
    'y1':131,
    'y2':895,
     'x1':180,
    'x2':330
}

#胜利之后出现宝箱之后，点击位置，防止时延影响点到不该点的位置
win_mark_box_tap={
    'y1':131,
    'y2':895,
     'x1':180,
    'x2':330
}

#胜利之后出现宝箱之后，点击位置，防止时延影响点到不该点的位置
single_failure_tap={
    'y1':131,
    'y2':895,
     'x1':180,
    'x2':330
}


#组队的
#组队开始按钮
start_fighting = {
    'y1':863,
    'y2':940,
    'x1':1545,
    'x2':1799
}


#组队失败之后的位置坐标
team_failure = {
    'y1':115,
    'y2':313,
    'x1':717,
    'x2':903
}

#单人胜利之后的大鼓的位置坐标
team_win_mark_drum = {
    'y1':143,
    'y2':309,
    'x1':737,
    'x2':927
}

#胜利之后的宝箱的下半部分坐标
team_win_mark_box={
    'y1':878,
    'y2':944,
    'x1':894,
    'x2':1212
}
#####################################################
#突破
tupo_ticket={
    'y1':916,
    'y2':944,
    'x1':830,
    'x2':869
}