#coding:utf-8
#MI8

device_id = 'emulator-5554'

#单人的
#单人胜利之后的大鼓的位置坐标
win_mark_drum = {
    'y1':216,
    'y2':410,
    'x1':734,
    'x2':927
}

#胜利之后的宝箱的下半部分坐标
win_mark_box={
    'y1':878,
    'y2':944,
    'x1':894,
    'x2':1212
}

#单人挑战按钮位置坐标
challenge_btn = {
    'y1':709,
    'y2':773,
    'x1':1454,
    'x2':1620
}

#单人失败之后的大鼓的位置坐标
single_failure = {
    'y1':204,
    'y2':382,
    'x1':710,
    'x2':912
}


#通用的
#胜利之后出现大鼓时候点击位置，防止时延影响点到不该点的位置
win_mark_drum_tap = {
    'y1':131,
    'y2':895,
     'x1':160,
    'x2':330
}

#胜利之后出现宝箱之后，点击位置，防止时延影响点到不该点的位置
win_mark_box_tap={
    'y1':131,
    'y2':895,
     'x1':160,
    'x2':330
}

#胜利之后出现宝箱之后，点击位置，防止时延影响点到不该点的位置
single_failure_tap={
    'y1':131,
    'y2':895,
     'x1':160,
    'x2':330
}


#组队的
#组队开始按钮
start_fighting = {
    'y1':863,
    'y2':940,
    'x1':1545,
    'x2':1799
}

#组队失败之后的位置坐标
team_failure = {
    'y1':115,
    'y2':313,
    'x1':717,
    'x2':903
}

#单人胜利之后的大鼓的位置坐标
team_win_mark_drum = {
    'y1':143,
    'y2':309,
    'x1':737,
    'x2':927
}

#胜利之后的宝箱的下半部分坐标
team_win_mark_box={
    'y1':878,
    'y2':944,
    'x1':894,
    'x2':1212
}
