#coding:utf-8
#MI5
#小米5的设备id
device_id = 'c84e662d'

#胜利之后的大鼓的位置坐标
win_mark_drum = {
    'y1':149,
    'y2':286,
    'x1':632,
    'x2':826
}
#胜利之后的宝箱的下半部分坐标
win_mark_box={
    'y1':796,
    'y2':905,
    'x1':794,
    'x2':1093
}
#单人挑战按钮位置坐标
challenge_btn = {
    'y1':703,
    'y2':780,
    'x1':1335,
    'x2':1518
}
#单人失败之后的大鼓的位置坐标
single_failure = {
    'y1':195,
    'y2':423,
    'x1':604,
    'x2':872
}


#单人胜利之后出现大鼓时候点击位置，防止时延影响点到不该点的位置
win_mark_drum_tap = {
    'y1':87,
    'y2':953,
    'x1':180,
    'x2':330
}

#胜利之后出现宝箱之后，点击位置，防止时延影响点到不该点的位置
win_mark_box_tap={
    'y1':87,
    'y2':953,
    'x1':180,
    'x2':330
}

#胜利之后出现宝箱之后，点击位置，防止时延影响点到不该点的位置
single_failure_tap={
    'y1':87,
    'y2':953,
    'x1':180,
    'x2':330
}



#组队开始按钮
start_fighting = {
    'y1':862,
    'y2':933,
    'x1':1432,
    'x2':1685
}


#组队失败之后的位置坐标
team_failure = {
    'y1':107,
    'y2':303,
    'x1':603,
    'x2':802
}

#单人胜利之后的大鼓的位置坐标
team_win_mark_drum = {
    'y1':123,
    'y2':310,
    'x1':627,
    'x2':815
}

#胜利之后的宝箱的下半部分坐标
team_win_mark_box={
    'y1':881,
    'y2':943,
    'x1':783,
    'x2':1103
}
